In [87]:
#Dependencies
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

#Upload from CSVs
meat_pop_path = "New Files/meat_totals.csv"
us_temps_path = "New Files/global_temps_country.csv"
global_temps_path = "New Files/global_temps.csv"

#Read data and results
meat_pop_df = pd.read_csv(meat_pop_path)
us_temps_df = pd.read_csv(us_temps_path)
global_temps_df = pd.read_csv(global_temps_path)


us_temps_df

,year,month,day,AverageTemperature,AverageTemperatureUncertainty,Country
0,1768,9.0,1.0,15.420,2.880,United States
1,1768,10.0,1.0,8.162,3.386,United States
2,1768,11.0,1.0,1.591,3.783,United States
3,1768,12.0,1.0,-2.882,4.979,United States
4,1769,1.0,1.0,-3.952,4.856,United States
...,...,...,...,...,...,...
2936,1779,8.0,1.0,NaN,NaN,United States
2937,1779,9.0,1.0,NaN,NaN,United States
2938,1779,10.0,1.0,NaN,NaN,United States
2939,1779,11.0,1.0,NaN,NaN,United States
2940,1779,12.0,1.0,NaN,NaN,United States

In [88]:
#Remove Error Message "https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy"
pd.options.mode.copy_on_write = True

In [89]:
# Look at Data types and modify if necessary
meat_pop_df.dtypes

Month                      int64
Day                        int64
Year                       int64
beef_commercial          float64
veal_commercial          float64
pork_commercial          float64
lamb_commercial          float64
total_red_commercial     float64
beef_federal             float64
veal_federal             float64
pork_federal             float64
lamb_federal             float64
total_red_federal        float64
broilers_federal         float64
chicken_federal          float64
turkey_federal           float64
total_poultry_federal    float64
total_meat_federal       float64
dtype: object

In [90]:
#Find total red meat overall and make new column
meat_pop_df["total_red_meat"] = meat_pop_df["total_red_commercial"]+meat_pop_df["total_red_federal"]

meat_pop_df.head()

,Month,Day,Year,beef_commercial,veal_commercial,pork_commercial,lamb_commercial,total_red_commercial,beef_federal,veal_federal,pork_federal,lamb_federal,total_red_federal,broilers_federal,chicken_federal,turkey_federal,total_poultry_federal,total_meat_federal,total_red_meat
0,2,1,2024,2168.5,3.6,2371.2,10.9,4554.2,2135.0,3.4,2361.4,9.8,4509.6,3734.3,44.4,423.9,4213.3,8722.9,9063.8
1,1,1,2024,2280.8,3.9,2472.7,10.6,4768.0,2246.1,3.8,2462.4,9.6,4721.9,4051.4,47.4,435.2,4547.6,9269.5,9489.9
2,12,1,2023,2189.9,3.9,2342.0,10.7,4546.4,2159.0,3.7,2332.4,9.5,4504.7,3616.2,41.5,393.0,4063.1,8567.8,9051.1
3,11,1,2023,2280.9,4.3,2388.2,11.2,4684.5,2247.3,4.1,2377.4,10.1,4638.9,3817.3,44.5,449.2,4324.0,8962.9,9323.4
4,10,1,2023,2340.9,4.2,2418.5,11.3,4774.8,2300.8,4.0,2406.2,9.8,4720.8,4177.3,51.0,500.5,4742.1,9462.9,9495.6

In [92]:
#Look for only 1977 and after because null values before that
meat_pop_1977_df = meat_pop_df.loc[meat_pop_df["Year"]>=1977]

#Pull only columns needed
meat_pop_1977_df = meat_pop_1977_df[["Month", "Year", "total_red_commercial", "total_red_federal", "total_red_meat"]]

#Drop Null Values

meat_pop_1977_df = meat_pop_1977_df.dropna()

meat_pop_1977_df

     Month  Year  total_red_commercial  total_red_federal  total_red_meat
0        2  2024                4554.2             4509.6          9063.8
1        1  2024                4768.0             4721.9          9489.9
2       12  2023                4546.4             4504.7          9051.1
3       11  2023                4684.5             4638.9          9323.4
4       10  2023                4774.8             4720.8          9495.6
..     ...   ...                   ...                ...             ...
562      5  1977                3121.8             2935.0          6056.8
563      4  1977                3194.9             3007.0          6201.9
564      3  1977                3550.8             3334.0          6884.8
565      2  1977                3083.9             2888.0          5971.9
566      1  1977                3236.7             3031.0          6267.7

[558 rows x 5 columns]

In [72]:
#Drop Null Values to convert Dtypes
us_temps_df = us_temps_df.dropna()

In [73]:
#Change Data Types
us_temps_df["month"] = us_temps_df["month"].astype("int64")
us_temps_df.dtypes

year                               int64
month                              int64
day                              float64
AverageTemperature               float64
AverageTemperatureUncertainty    float64
Country                           object
dtype: object

In [100]:
#Rename to match meat data frame
us_temps_df = us_temps_df.rename(columns={"year":"Year", "month":"Month"})

us_temps_df.dtypes
# #Filter to 1977
us_temps_1977_df = us_temps_df.loc[us_temps_df["Year"]>=1977]


us_temps_1977_df

,Year,Month,day,AverageTemperature,AverageTemperatureUncertainty,Country
1122,1979,NaN,NaN,18.337,0.283,United States
1123,2009,NaN,NaN,20.432,0.230,United States
1124,2040,NaN,NaN,20.473,0.267,United States
1125,2071,NaN,NaN,16.206,0.233,United States
1126,2101,NaN,NaN,8.391,0.411,United States
...,...,...,...,...,...,...
2917,40330,NaN,NaN,19.885,0.182,United States
2918,40360,NaN,NaN,22.078,0.229,United States
2919,40391,NaN,NaN,21.703,0.256,United States
2920,40422,NaN,NaN,17.384,0.113,United States
2921,40452,NaN,NaN,10.913,0.053,United States

In [97]:
#Merge!

us_temps_meat_df = pd.merge(meat_pop_1977_df, us_temps_df, on = "Year", how = "outer")

us_temps_meat_df

,Month_x,Year,total_red_commercial,total_red_federal,total_red_meat,Month_y,day,AverageTemperature,AverageTemperatureUncertainty,Country
0,2.0,2024,4554.2,4509.6,9063.8,NaN,NaN,NaN,NaN,NaN
1,1.0,2024,4768.0,4721.9,9489.9,NaN,NaN,NaN,NaN,NaN
2,12.0,2023,4546.4,4504.7,9051.1,NaN,NaN,NaN,NaN,NaN
3,11.0,2023,4684.5,4638.9,9323.4,NaN,NaN,NaN,NaN,NaN
4,10.0,2023,4774.8,4720.8,9495.6,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
3492,NaN,1779,NaN,NaN,NaN,8.0,1.0,NaN,NaN,United States
3493,NaN,1779,NaN,NaN,NaN,9.0,1.0,NaN,NaN,United States
3494,NaN,1779,NaN,NaN,NaN,10.0,1.0,NaN,NaN,United States
3495,NaN,1779,NaN,NaN,NaN,11.0,1.0,NaN,NaN,United States
3496,NaN,1779,NaN,NaN,NaN,12.0,1.0,NaN,NaN,United States